Belief.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Commentary on Helier Robinson's "Belief Shock"</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-15 Sun"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Commentary on Helier Robinson's "Belief Shock"</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 False Belief </a></li>
<li><a href="#sec-2">2 Identity and Change </a></li>
<li><a href="#sec-3">3 Five Realities </a></li>
<li><a href="#sec-4">4 Naive Realism </a></li>
<li><a href="#sec-5">5 Metarealism </a></li>
<li><a href="#sec-6">6 Some Sophistries </a></li>
<li><a href="#sec-7">7 A Dilemma and Two Nutshells </a></li>
<li><a href="#sec-8">8 Two Heads are Better than One </a></li>
<li><a href="#sec-9">9 Leibniz and Russell </a></li>
<li><a href="#sec-10">10 Four More Problems </a></li>
<li><a href="#sec-11">11 More Details </a></li>
<li><a href="#sec-12">12 Four Notes </a></li>
<li><a href="#sec-13">13 Solipsism </a></li>
<li><a href="#sec-14">14 Science </a></li>
<li><a href="#sec-15">15 Philosophy of Science </a></li>
<li><a href="#sec-16">16 Problems with Relations </a></li>
<li><a href="#sec-17">17 Affirmation of Relations </a></li>
<li><a href="#sec-18">18 Absolute Values </a></li>
<li><a href="#sec-19">19 The Basis of Human Values </a></li>
<li><a href="#sec-20">20 Nothing but the Best </a></li>
<li><a href="#sec-21">21 Ego and Consciousness </a></li>
<li><a href="#sec-22">22 Action, Belief and the Irrational </a></li>
<li><a href="#sec-23">23 Discrimination and Language </a></li>
<li><a href="#sec-24">24 Conflict and the Oge </a></li>
<li><a href="#sec-25">25 Love and Hate </a></li>
<li><a href="#sec-26">26 Introjection and Projection </a></li>
<li><a href="#sec-27">27 Extremism, Heaven, and Hell </a></li>
<li><a href="#sec-28">28 Politics </a></li>
<li><a href="#sec-29">29 Fanaticism and Tragedy </a></li>
<li><a href="#sec-30">30 Dominance </a></li>
<li><a href="#sec-31">31 Neurosis </a></li>
<li><a href="#sec-32">32 Feeling and Thinking </a></li>
<li><a href="#sec-33">33 Mathematics and Music </a></li>
<li><a href="#sec-34">34 The Problem of Universals </a></li>
<li><a href="#sec-35">35 Four Kinds of Universal </a></li>
<li><a href="#sec-36">36 Three Kinds of Meaning </a></li>
<li><a href="#sec-37">37 Rational Feeling </a></li>
<li><a href="#sec-38">38 Four More Gods </a></li>
<li><a href="#sec-39">39 Practice Makes Perfect </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> False Belief </h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Identity and Change </h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Five Realities </h2>
<div class="outline-text-2" id="text-3">

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Naive Realism </h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Metarealism </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Some Sophistries </h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> A Dilemma and Two Nutshells </h2>
<div class="outline-text-2" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Two Heads are Better than One </h2>
<div class="outline-text-2" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Leibniz and Russell </h2>
<div class="outline-text-2" id="text-9">

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Four More Problems </h2>
<div class="outline-text-2" id="text-10">

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> More Details </h2>
<div class="outline-text-2" id="text-11">

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Four Notes </h2>
<div class="outline-text-2" id="text-12">

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Solipsism </h2>
<div class="outline-text-2" id="text-13">

</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Science </h2>
<div class="outline-text-2" id="text-14">

</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Philosophy of Science </h2>
<div class="outline-text-2" id="text-15">

</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Problems with Relations </h2>
<div class="outline-text-2" id="text-16">

</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Affirmation of Relations </h2>
<div class="outline-text-2" id="text-17">

</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Absolute Values </h2>
<div class="outline-text-2" id="text-18">

</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> The Basis of Human Values </h2>
<div class="outline-text-2" id="text-19">

</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Nothing but the Best </h2>
<div class="outline-text-2" id="text-20">

</div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Ego and Consciousness </h2>
<div class="outline-text-2" id="text-21">

</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Action, Belief and the Irrational </h2>
<div class="outline-text-2" id="text-22">

</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Discrimination and Language </h2>
<div class="outline-text-2" id="text-23">

</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Conflict and the Oge </h2>
<div class="outline-text-2" id="text-24">

</div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Love and Hate </h2>
<div class="outline-text-2" id="text-25">

</div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Introjection and Projection </h2>
<div class="outline-text-2" id="text-26">

</div>

</div>

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> Extremism, Heaven, and Hell </h2>
<div class="outline-text-2" id="text-27">

</div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> Politics </h2>
<div class="outline-text-2" id="text-28">

</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> Fanaticism and Tragedy </h2>
<div class="outline-text-2" id="text-29">

</div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> Dominance </h2>
<div class="outline-text-2" id="text-30">

</div>

</div>

<div id="outline-container-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> Neurosis </h2>
<div class="outline-text-2" id="text-31">

</div>

</div>

<div id="outline-container-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> Feeling and Thinking </h2>
<div class="outline-text-2" id="text-32">

</div>

</div>

<div id="outline-container-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> Mathematics and Music </h2>
<div class="outline-text-2" id="text-33">

</div>

</div>

<div id="outline-container-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> The Problem of Universals </h2>
<div class="outline-text-2" id="text-34">

<p>The <b>PROBLEM OF UNIVERSALS</b>
</p><ul>
<li>
What kind of meaning do universals have?

</li>
</ul>

<p>Medieval Solutions
</p><ul>
<li>
Nominalism
</li>
<li>
Conceptualism
</li>
<li>
Platonism (misnomer)

</li>
</ul>

<p>Spinoza argues that there are two
kinds of universal:
</p><ul>
<li>
Adequate Ideas   (Clear and Distinct)
</li>
<li>
Inadequate Ideas (Confused)

</li>
</ul>

<p>Extensionalism (Logistic Program of Whitehead and Russell)
</p>
<p>
Intensionalism
</p></div>

</div>

<div id="outline-container-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> Four Kinds of Universal </h2>
<div class="outline-text-2" id="text-35">

<p>To address the <b>PROBLEM OF UNIVERSALS</b>, Robinson provides
a Spinozistic type of solution: there are multiple kinds
of universal. 
</p>
<ul>
<li>
Intensional Meaning
</li>
<li>
Extensional Meaning
</li>
<li>
Irrational Extensional Meaning
</li>
<li>
Nominal Meaning

</li>
</ul>
</div>

</div>

<div id="outline-container-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> Three Kinds of Meaning </h2>
<div class="outline-text-2" id="text-36">

</div>

</div>

<div id="outline-container-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> Rational Feeling </h2>
<div class="outline-text-2" id="text-37">

</div>

</div>

<div id="outline-container-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> Four More Gods </h2>
<div class="outline-text-2" id="text-38">

</div>

</div>

<div id="outline-container-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> Practice Makes Perfect </h2>
<div class="outline-text-2" id="text-39">

</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-12-15 Sun</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
